Revit 2024 API
DimensionSegment.ValueOverride Property
The text that replaces the segment's value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string ValueOverride { get; set; }
Visual Basic
Public Property ValueOverride As String
	Get
	Set
Visual C++
public:
property String^ ValueOverride {
	String^ get ();
	void set (String^ value);
}
See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace